Revit 2024 API
DocumentSaveToCentralProgressChangedEventArgs.FailureDueToConflicts Property
 Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public bool FailureDueToConflicts { get; }
Visual Basic
Public ReadOnly Property FailureDueToConflicts As Boolean
	Get
Visual C++
public:
property bool FailureDueToConflicts {
	bool get ();
}
See Also
DocumentSaveToCentralProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace